### Q1 For the following code, which of the following statements will not return True?

In [47]:
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [48]:
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [49]:
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [50]:
import math
math.isnan(obj2['California'])

True

In [51]:
x = obj2['California']
obj2['California'] != x

True

In [52]:
obj3['California']

True

In [53]:
obj2['California'] == None

False

### Q2 In the below python code, the keys of the dictionary d represent student ranks and the value for each key is a student name. Which of the following can be used to extract rows with student ranks that are lower than or equal to 3?

In [54]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)

In [55]:
S

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

In [56]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

### Q3 Suppose we have a DataFrame named df. We want to change the original DataFrame df in a way that all the column names are cast to upper case. Which of the following expressions is incorrect to perform the same?

In [57]:
html_string = """
<table>
  <thead>
    <tr>
      <th>date</th>
      <th>name</th>
      <th>year</th>
      <th>cost</th>
      <th>region</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>2020-01-01</td>
      <td>Jenny</td>
      <td>1998</td>
      <td>0.2</td>
      <td>South</td>
    </tr>
    <tr>
      <td>2020-01-02</td>
      <td>Alice</td>
      <td>1992</td>
      <td>-1.34</td>
      <td>East</td>
    </tr>
    <tr>
      <td>2020-01-03</td>
      <td>Tomas</td>
      <td>1982</td>
      <td>1.00023</td>
      <td>South</td>
    </tr>
  </tbody>
</table>
"""

In [58]:
dfs = pd.read_html(html_string)
type(dfs)

list

In [59]:
df = dfs[0]
df

         date   name  year     cost region
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

In [60]:
# correct
df.rename(mapper = lambda x: x.upper(), axis=1, inplace=True)
df

         DATE   NAME  YEAR     COST REGION
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

In [61]:
# correct
df = df.rename(mapper = lambda x: x.upper(), axis = 'columns')
df

         DATE   NAME  YEAR     COST REGION
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

In [62]:
# correct
df = df.rename(mapper = lambda x: x.upper(), axis = 1)

In [63]:
# incorrect
df.rename(mapper = lambda x: x.upper(), axis=1)
df

         DATE   NAME  YEAR     COST REGION
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

### Q4 For the given DataFrame df we want to keep only the records with a toefl score greater than 105. Which of the following will not work?

In [64]:
df = pd.DataFrame(columns = ['serial-no','gre-score', 'toefl-score'])
df['serial-no'] = [1,2,3,4,5]
df['gre-score'] = [337,324,316,322,314]
df['toefl-score'] = [118,107,104,110,103]
df

   serial-no  gre-score  toefl-score
0          1        337          118
1          2        324          107
2          3        316          104
3          4        322          110
4          5        314          103

In [65]:
# correct
df[df['toefl-score'] > 105]

   serial-no  gre-score  toefl-score
0          1        337          118
1          2        324          107
3          4        322          110

In [66]:
# correct
df.where(df['toefl-score'] > 105).dropna()

   serial-no  gre-score  toefl-score
0        1.0      337.0        118.0
1        2.0      324.0        107.0
3        4.0      322.0        110.0

In [67]:
# incorrect
df.where(df['toefl-score'] > 105)

   serial-no  gre-score  toefl-score
0        1.0      337.0        118.0
1        2.0      324.0        107.0
2        NaN        NaN          NaN
3        4.0      322.0        110.0
4        NaN        NaN          NaN

### Q5 Which of the following can be used to create a DataFrame in Pandas?

- 2D ndarray
- Pandas Series object
- Python dict
- **All of the above**

### Q6 Which of the following is an incorrect way to drop entries from the Pandas DataFrame named df shown below?

In [68]:
index = ['Ohio', 'Colorado', 'Utah', 'New York']
columns = ['one','two','three','four']
df = pd.DataFrame([[0,1,2,3],[4,5,6,7],[8,9,10,11],[12,13,14,15]],index=index, columns=columns)
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
# correct
df.drop(['Utah', 'Colorado'])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [70]:
# correct
df.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [71]:
# correct
df.drop('one', axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [72]:
# incorrect
df.drop('two')

KeyError: "['two'] not found in axis"

### Q7 - For the Series s1 and s2 defined below, which of the following statements will give an error?

In [73]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [74]:
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [75]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [76]:
# op1
s1.loc[1]

'Alice'

In [77]:
# op2
s2[1]

2

In [78]:
# op3
s2.loc[1]

KeyError: 1

### Q8 - Which of the following statements is incorrect?

In [79]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({1: 'Alice', 2: 'Jack'})

# op1 - We can use s.iteritems() on a pd.Series object s to iterate on it.
# s1.iteritems() # TRUE

# op2 - If s is a pd.Series object, then we can use s.loc[label] to get all data where the index is equal to label.
# s1.loc[0] # TRUE

# op3 - If s and s1 are two pd.Series objects, we cannot use s.append(s1) to directly append s1 to the existing series s
s2.append(s1)  # TRUE

# op4 - loc and iloc are two useful and commonly used Pandas methods.
# false

1    Alice
2     Jack
1    Alice
2     Jack
3    Molly
dtype: object

### Q9 - For the given DataFrame df shown above, we want to get all records with a toefl score greater than 105 but smaller than 115. Which of the following expressions is incorrect to perform the same?

In [80]:
df = pd.DataFrame(columns = ['serial-no','gre-score', 'toefl-score'])
df['serial-no'] = [1,2,3,4,5]
df['gre-score'] = [337,324,316,322,314]
df['toefl-score'] = [118,107,104,110,103]
df

   serial-no  gre-score  toefl-score
0          1        337          118
1          2        324          107
2          3        316          104
3          4        322          110
4          5        314          103

In [81]:
# op1
df[(df['toefl-score'].isin(range(106, 115)))]

   serial-no  gre-score  toefl-score
1          2        324          107
3          4        322          110

In [82]:
# op2
df[df['toefl-score'].gt(105) & df['toefl-score'].lt(115)]

   serial-no  gre-score  toefl-score
1          2        324          107
3          4        322          110

In [83]:
# op3
(df['toefl-score'] > 105) & (df['toefl-score'] < 115)

0    False
1     True
2    False
3     True
4    False
Name: toefl-score, dtype: bool

In [84]:
# op4
df[(df['toefl-score'] > 105) & (df['toefl-score'] < 115)]

   serial-no  gre-score  toefl-score
1          2        324          107
3          4        322          110

### Q10 - Which of the following is the correct way to extract all information related to the student named Alice from the DataFrame df given below:

In [ ]:
d = {'Major': ['Mathematics', 'Biology'], 
     'Name': ['Alice', 'Jack'],
    'Age': [20, 22],
    'Gender': ['F','M']}
df = pd.DataFrame(data=d)
df

In [ ]:
# op1
# df['Alice'] # error

# op2
# df.T['Mathematics']

# op3
# df['Mathematics']

# op4
# df.iloc['Mathematics']